## [liquibase-docs-staging](https://liquibase.app.spacelift.io/stack/liquibase-docs-staging/run/01J4HTHQYHF25RECF8FC4M1MF3) plan logs

<details>
<summary>Click here to expand</summary>

```
...
aws_s3_object.redirects["/concepts/changelogs/structure-changelogs.html"]: Refreshing state... [id=/concepts/changelogs/structure-changelogs.html]
aws_s3_object.redirects["/tools-integrations/extensions/remote-files/s3-commands.html"]: Refreshing state... [id=/tools-integrations/extensions/remote-files/s3-commands.html]
aws_s3_object.redirects["/start/tutorials/maxdb.html"]: Refreshing state... [id=/start/tutorials/maxdb.html]
aws_s3_object.redirects["/commands/config-ref/logicalfilepath.html"]: Refreshing state... [id=/commands/config-ref/logicalfilepath.html]
aws_s3_object.redirects["/change-types/community/create-sequence.html"]: Refreshing state... [id=/change-types/community/create-sequence.html]
aws_s3_object.redirects["/concepts/advanced/liquibase-schema-name-parameter.html"]: Refreshing state... [id=/concepts/advanced/liquibase-schema-name-parameter.html]
aws_s3_object.redirects["/tools-integrations/maven/workflows/maven-get-oracle-drivers.html"]: Refreshing state... [id=/tools-integrations/maven/workflows/maven-get-oracle-drivers.html]
aws_s3_object.redirects["/start/getting-started-liquibase-yaml.html"]: Refreshing state... [id=/start/getting-started-liquibase-yaml.html]
aws_s3_object.redirects["/commands/config-ref/changelog-lock-wait-time-in-minutes-parameter.html"]: Refreshing state... [id=/commands/config-ref/changelog-lock-wait-time-in-minutes-parameter.html]
aws_s3_object.redirects["/commands/quality-checks/checks/object-name-must-match.html"]: Refreshing state... [id=/commands/quality-checks/checks/object-name-must-match.html]
aws_s3_object.redirects["/start/tutorials/voltdb.html"]: Refreshing state... [id=/start/tutorials/voltdb.html]
aws_s3_object.redirects["/start/get-started/getting-started-liquibase-json-windows.html"]: Refreshing state... [id=/start/get-started/getting-started-liquibase-json-windows.html]
aws_s3_object.redirects["/commands/rollbackcountsql.html"]: Refreshing state... [id=/commands/rollbackcountsql.html]
aws_s3_object.redirects["/commands/community/futurerollbackcountsql.html"]: Refreshing state... [id=/commands/community/futurerollbackcountsql.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-rollback-one-changeset.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-rollback-one-changeset.html]
aws_s3_object.redirects["/mongodb"]: Refreshing state... [id=/mongodb]
aws_s3_object.redirects["/tools-integrations/ant/getting-started-liquibase-ant.html"]: Refreshing state... [id=/tools-integrations/ant/getting-started-liquibase-ant.html]
aws_s3_object.redirects["/tools-integrations/liquibase-hub/operations.html"]: Refreshing state... [id=/tools-integrations/liquibase-hub/operations.html]
aws_s3_object.redirects["/commands/help.html"]: Refreshing state... [id=/commands/help.html]
aws_s3_object.redirects["/commands/community/updatetotag.html"]: Refreshing state... [id=/commands/community/updatetotag.html]
aws_s3_object.redirects["/tools-integrations/labs/variables.html"]: Refreshing state... [id=/tools-integrations/labs/variables.html]
aws_s3_object.redirects["/commands/diffchangelog.html"]: Refreshing state... [id=/commands/diffchangelog.html]
aws_s3_object.redirects["/start/install/tutorials/snowflake.html"]: Refreshing state... [id=/start/install/tutorials/snowflake.html]
aws_s3_object.redirects["/commands/status/status.html"]: Refreshing state... [id=/commands/status/status.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.13.0.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.13.0.html]
aws_s3_object.redirects["/commands/docs/db-doc.html"]: Refreshing state... [id=/commands/docs/db-doc.html]
aws_s3_object.redirects["/commands/maintenance/release-locks.html"]: Refreshing state... [id=/commands/maintenance/release-locks.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-rollback-one-update.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-rollback-one-update.html]
aws_s3_object.redirects["/change-types/community/create-table.html"]: Refreshing state... [id=/change-types/community/create-table.html]
aws_s3_object.redirects["/commands/quality-checks/run.html"]: Refreshing state... [id=/commands/quality-checks/run.html]
aws_s3_object.redirects["/commands/quality-checks/concepts/working-with-quality-checks.html"]: Refreshing state... [id=/commands/quality-checks/concepts/working-with-quality-checks.html]
aws_s3_object.redirects["/concepts/changelogs/attributes/use-sql-plus-integration.html"]: Refreshing state... [id=/concepts/changelogs/attributes/use-sql-plus-integration.html]
aws_s3_object.redirects["/start/install/tutorials/sap-hana.html"]: Refreshing state... [id=/start/install/tutorials/sap-hana.html]
aws_s3_object.redirects["/change-types/pro/drop-trigger.html"]: Refreshing state... [id=/change-types/pro/drop-trigger.html]
aws_s3_object.redirects["/start/install/tutorials/hibernate.html"]: Refreshing state... [id=/start/install/tutorials/hibernate.html]
aws_s3_object.redirects["/commands/community/status-verbose.html"]: Refreshing state... [id=/commands/community/status-verbose.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-changelogSyncToTag.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-changelogSyncToTag.html]
aws_s3_object.redirects["/commands/quality-checks/checks/change-truncate-table-warn.html"]: Refreshing state... [id=/commands/quality-checks/checks/change-truncate-table-warn.html]
aws_s3_object.redirects["/concepts/advanced/should-snapshot-data-parameter.html"]: Refreshing state... [id=/concepts/advanced/should-snapshot-data-parameter.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/cassandra.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/cassandra.html]
aws_s3_object.redirects["/commands/quality-checks/checks/sql-grant-admin-warn.html"]: Refreshing state... [id=/commands/quality-checks/checks/sql-grant-admin-warn.html]
aws_s3_object.redirects["/commands/change-tracking/mark-next-changeset-ran.html"]: Refreshing state... [id=/commands/change-tracking/mark-next-changeset-ran.html]
aws_s3_object.redirects["/flow"]: Refreshing state... [id=/flow]
aws_s3_object.redirects["/install/liquibase-linux.html"]: Refreshing state... [id=/install/liquibase-linux.html]
aws_s3_object.redirects["/tools-integrations/ant/commands/generatechangelog.html"]: Refreshing state... [id=/tools-integrations/ant/commands/generatechangelog.html]
aws_s3_object.redirects["/commands/init/hub.html"]: Refreshing state... [id=/commands/init/hub.html]
aws_s3_object.redirects["/tools-integrations/extensions/extension-upgrade-guides/home.html"]: Refreshing state... [id=/tools-integrations/extensions/extension-upgrade-guides/home.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.20.0.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.20.0.html]
aws_s3_object.redirects["/start/install/tutorials/h2.html"]: Refreshing state... [id=/start/install/tutorials/h2.html]
aws_s3_object.redirects["/concepts/advanced/using-sql-plus-and-oracle-proxy-user.html"]: Refreshing state... [id=/concepts/advanced/using-sql-plus-and-oracle-proxy-user.html]
aws_s3_object.redirects["/commands/working-with-command-parameters.html"]: Refreshing state... [id=/commands/working-with-command-parameters.html]
aws_s3_object.redirects["/concepts/changelogs/working-with-changelogs.html"]: Refreshing state... [id=/concepts/changelogs/working-with-changelogs.html]
aws_s3_object.redirects["/install/tutorials/hsqldb.html"]: Refreshing state... [id=/install/tutorials/hsqldb.html]
aws_s3_object.redirects["/commands/change-tracking/changelog-sync-to-tag-sql.html"]: Refreshing state... [id=/commands/change-tracking/changelog-sync-to-tag-sql.html]
aws_s3_object.redirects["/concepts/changelogs/attributes/include.html"]: Refreshing state... [id=/concepts/changelogs/attributes/include.html]
aws_s3_object.redirects["/tools-integrations/extensions/extension-upgrade-guides/lb-3.1-upgrade-guide.html"]: Refreshing state... [id=/tools-integrations/extensions/extension-upgrade-guides/lb-3.1-upgrade-guide.html]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_s3_object.redirects["/commands/community/deactivatechangelog.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/community/deactivatechangelog.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/community/registerChangeLog.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/community/registerChangeLog.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/community/registerchangelog.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/community/registerchangelog.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/community/synchub.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/community/synchub.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/deactivatechangelog.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/deactivatechangelog.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/hub/deactivate-changelog.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/hub/deactivate-changelog.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/hub/register-changelog.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/hub/register-changelog.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/hub/sync-hub.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/hub/sync-hub.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/init/hub.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/init/hub.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/liquibase-start/init-hub.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/liquibase-start/init-hub.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/registerchangelog.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/registerchangelog.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/synchub.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/synchub.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/concepts/changelogs/attributes/sql-plus-troubleshoot.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/concepts/changelogs/attributes/sql-plus-troubleshoot.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/native-executors/oracle-sqlplus-troubleshoot.html" -> "/liquibase-pro/native-executors/oracle-sqlplus-troubleshoot.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/concepts/changelogs/attributes/use-psql-integration.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/concepts/changelogs/attributes/use-psql-integration.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/native-executors/postgresql-psql" -> "/liquibase-pro/native-executors/postgresql-psql"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/concepts/changelogs/attributes/use-sql-plus-integration.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/concepts/changelogs/attributes/use-sql-plus-integration.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/native-executors/oracle-sqlplus.html" -> "/liquibase-pro/native-executors/oracle-sqlplus.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/concepts/changelogs/attributes/use-sql-plus-oracle-proxy-server.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/concepts/changelogs/attributes/use-sql-plus-oracle-proxy-server.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/native-executors/oracle-sqlplus-proxy-user.html" -> "/liquibase-pro/native-executors/oracle-sqlplus-proxy-user.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/concepts/changelogs/attributes/use-sqlcmd-integration.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/concepts/changelogs/attributes/use-sqlcmd-integration.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/native-executors/mssql-server-sqlcmd.html" -> "/liquibase-pro/native-executors/mssql-server-sqlcmd.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/concepts/changelogs/attributes/using-psql-integration.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/concepts/changelogs/attributes/using-psql-integration.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/native-executors/postgresql-psql" -> "/liquibase-pro/native-executors/postgresql-psql"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/concepts/changelogs/attributes/using-sql-plus-and-oracle-proxy-user.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/concepts/changelogs/attributes/using-sql-plus-and-oracle-proxy-user.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/native-executors/oracle-sqlplus-proxy-user.html" -> "/liquibase-pro/native-executors/oracle-sqlplus-proxy-user.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/concepts/changelogs/attributes/using-sql-plus-integration.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/concepts/changelogs/attributes/using-sql-plus-integration.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/native-executors/oracle-sqlplus.html" -> "/liquibase-pro/native-executors/oracle-sqlplus.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/concepts/changelogs/attributes/using-sqlcmd-integration.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/concepts/changelogs/attributes/using-sqlcmd-integration.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/native-executors/mssql-server-sqlcmd.html" -> "/liquibase-pro/native-executors/mssql-server-sqlcmd.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/database-reports"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/database-reports"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/operation-reports.html" -> "/liquibase-pro/observability/operation-reports.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/database-reports.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/database-reports.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/operation-reports.html" -> "/liquibase-pro/observability/operation-reports.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/drift-reports"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/drift-reports"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/operation-reports-drift-report.html" -> "/liquibase-pro/observability/operation-reports-drift-report.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/drift-reports.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/drift-reports.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/operation-reports-drift-report.html" -> "/liquibase-pro/observability/operation-reports-drift-report.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/dropall"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/dropall"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/utility/drop-all.html" -> "/commands/utility/drop-all.html "
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/dropall.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/dropall.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/utility/drop-all.html" -> "/commands/utility/drop-all.html "
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/mdc"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/mdc"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/observability"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/observability"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/home.html" -> "/liquibase-pro/observability/home.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/observability.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/observability.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/home.html" -> "/liquibase-pro/observability/home.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/operation-reports"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/operation-reports"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/operation-reports.html" -> "/liquibase-pro/observability/operation-reports.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/operation-reports.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/operation-reports.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/operation-reports.html" -> "/liquibase-pro/observability/operation-reports.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/start/tutorials/mongodb-pro/mongodb-changelog-formats.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/start/tutorials/mongodb-pro/mongodb-changelog-formats.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/native-executors/mongodb-mongosh.html" -> "/liquibase-pro/native-executors/mongodb-mongosh.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/start/tutorials/mongodb-pro/using-mongosh-changelog.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/start/tutorials/mongodb-pro/using-mongosh-changelog.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/native-executors/mongodb-mongosh.html" -> "/liquibase-pro/native-executors/mongodb-mongosh.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/start/tutorials/mongodb/mongodb-changelog-formats.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/start/tutorials/mongodb/mongodb-changelog-formats.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/native-executors/mongodb-mongosh.html" -> "/liquibase-pro/native-executors/mongodb-mongosh.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/start/tutorials/mongodb/using-mongosh-changelog.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/start/tutorials/mongodb/using-mongosh-changelog.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/native-executors/mongodb-mongosh.html" -> "/liquibase-pro/native-executors/mongodb-mongosh.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/structured-logging"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/structured-logging"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/liquibase-hub/auto-registration-and-report-links.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/liquibase-hub/auto-registration-and-report-links.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/liquibase-hub/commands.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/liquibase-hub/commands.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/liquibase-hub/devops-metrics.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/liquibase-hub/devops-metrics.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/liquibase-hub/home.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/liquibase-hub/home.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/liquibase-hub/operations.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/liquibase-hub/operations.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/liquibase-hub/organizations.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/liquibase-hub/organizations.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/liquibase-hub/pipelines.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/liquibase-hub/pipelines.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/liquibase-hub/projects.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/liquibase-hub/projects.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/liquibase-hub/properties.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/liquibase-hub/properties.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/liquibase-hub/release-notes.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/liquibase-hub/release-notes.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/liquibase-hub/setup.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/liquibase-hub/setup.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/liquibase-hub/user.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/liquibase-hub/user.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/maven/commands/maven-deactivate-changelog.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/maven/commands/maven-deactivate-changelog.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/maven/commands/maven-deactivateChangeLog.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/maven/commands/maven-deactivateChangeLog.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/maven/commands/maven-deactivatechangelog.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/maven/commands/maven-deactivatechangelog.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/maven/commands/maven-register-changelog.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/maven/commands/maven-register-changelog.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/maven/commands/maven-registerChangeLog.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/maven/commands/maven-registerChangeLog.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/maven/commands/maven-registerchangelog.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/maven/commands/maven-registerchangelog.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/maven/commands/maven-sync-hub.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/maven/commands/maven-sync-hub.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/maven/commands/maven-syncHub.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/maven/commands/maven-syncHub.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/maven/commands/maven-synchub.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/maven/commands/maven-synchub.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/maven/workflows/hub-pom-attributes.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/maven/workflows/hub-pom-attributes.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging.html" -> "/liquibase-pro/observability/structured-logging.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/native-executors/benefits.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/native-executors/benefits.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/native-executors/benefits.html"
    }

  # aws_s3_object.redirects["/tools-integrations/native-executors/best-practices.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/native-executors/best-practices.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/native-executors/best-practices.html"
    }

  # aws_s3_object.redirects["/tools-integrations/native-executors/home.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/native-executors/home.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/native-executors/home.html"
    }

  # aws_s3_object.redirects["/tools-integrations/native-executors/mongodb-mongosh.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/native-executors/mongodb-mongosh.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/native-executors/mongodb-mongosh.html"
    }

  # aws_s3_object.redirects["/tools-integrations/native-executors/msqql-server-sqlcmd.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/native-executors/msqql-server-sqlcmd.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/native-executors/msqql-server-sqlcmd.html"
    }

  # aws_s3_object.redirects["/tools-integrations/native-executors/oracle-sqlplus-proxy-user.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/native-executors/oracle-sqlplus-proxy-user.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/native-executors/oracle-sqlplus-proxy-user.html"
    }

  # aws_s3_object.redirects["/tools-integrations/native-executors/oracle-sqlplus-troubleshoot.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/native-executors/oracle-sqlplus-troubleshoot.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/native-executors/oracle-sqlplus-troubleshoot.html"
    }

  # aws_s3_object.redirects["/tools-integrations/native-executors/oracle-sqlplus.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/native-executors/oracle-sqlplus.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/native-executors/oracle-sqlplus.html"
    }

  # aws_s3_object.redirects["/tools-integrations/native-executors/postgresql-psql.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/native-executors/postgresql-psql.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/native-executors/postgresql-psql.html"
    }

  # aws_s3_object.redirects["/tools-integrations/observability/database-reports.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/observability/database-reports.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/operation-reports.html" -> "/liquibase-pro/observability/operation-reports.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/observability/home.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/observability/home.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/observability/home.html"
    }

  # aws_s3_object.redirects["/tools-integrations/observability/meta-data-structured-logs.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/observability/meta-data-structured-logs.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/structured-logging-custom-data.html" -> "/liquibase-pro/observability/structured-logging-custom-data.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/observability/operation-reports-checks-report.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/observability/operation-reports-checks-report.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/observability/operation-reports-checks-report.html"
    }

  # aws_s3_object.redirects["/tools-integrations/observability/operation-reports-checks-run-report.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/observability/operation-reports-checks-run-report.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/tools-integrations/observability/operation-reports-checks-report.html" -> "/liquibase-pro/observability/operation-reports-checks-report.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/observability/operation-reports-drift-report.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/observability/operation-reports-drift-report.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/observability/operation-reports-drift-report.html"
    }

  # aws_s3_object.redirects["/tools-integrations/observability/operation-reports-rollback-report.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/observability/operation-reports-rollback-report.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/observability/operation-reports-rollback-report.html"
    }

  # aws_s3_object.redirects["/tools-integrations/observability/operation-reports-update-report.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/observability/operation-reports-update-report.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/observability/operation-reports-update-report.html"
    }

  # aws_s3_object.redirects["/tools-integrations/observability/operation-reports.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/observability/operation-reports.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/observability/operation-reports.html"
    }

  # aws_s3_object.redirects["/tools-integrations/observability/structured-logging-custom-data.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/observability/structured-logging-custom-data.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/observability/structured-logging-custom-data.html"
    }

  # aws_s3_object.redirects["/tools-integrations/observability/structured-logging-keys.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/observability/structured-logging-keys.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/observability/structured-logging-keys.html"
    }

  # aws_s3_object.redirects["/tools-integrations/observability/structured-logging.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/observability/structured-logging.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/observability/structured-logging.html"
    }

Plan: 18 to add, 62 to change, 0 to destroy.

[01J4GYFVQCN70YYVWA6Y6ZEHK2] Changes are GO
[01J4GYFVQCN70YYVWA6Y6ZEHK2] Uploading the list of managed resources...
[01J4GYFVQCN70YYVWA6Y6ZEHK2] Generating Infracost JSON report from plan

[01J4GYFVQCN70YYVWA6Y6ZEHK2] Infracost report generated successfully
[01J4GYFVQCN70YYVWA6Y6ZEHK2] Mapping Infracost data to resources
[01J4GYFVQCN70YYVWA6Y6ZEHK2] Costs mapped successfully
[01J4GYFVQCN70YYVWA6Y6ZEHK2] Please be aware that the run changes calculation includes output changes.
[01J4GYFVQCN70YYVWA6Y6ZEHK2] Resource list upload is GO
[01J4GYFVQCN70YYVWA6Y6ZEHK2] Generating JSON representation of the plan...
[01J4GYFVQCN70YYVWA6Y6ZEHK2] JSON representation is GO
[01J4GYFVQCN70YYVWA6Y6ZEHK2] Generating Infracost JSON report from plan

[01J4GYFVQCN70YYVWA6Y6ZEHK2] Infracost report generated successfully
[01J4GYFVQCN70YYVWA6Y6ZEHK2] Loading custom plan policy inputs...
[01J4GYFVQCN70YYVWA6Y6ZEHK2] 0 custom plan policy inputs found
[01J4GYFVQCN70YYVWA6Y6ZEHK2] No plan policies to evaluate
```

</details>